/**
 * define the configuration of this system
 */
define(function(require, exports, module) {
	exports.regulars = {
		require: /.{1,}/,
		empty: /^\s*$/,
		phoneNumber: /(^0{0,1}1[3|4|5|6|7|8|9][0-9]{9}$)/,
		email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
		password: /^[\w\W]{6,23}$/,
		authCode: /^[0-9]{6}$/,
		money: /^([0-9]+|[0-9]{1,3}(,[0-9]{3})*)(.[0-9]{1,2})?$/, // money
		Int: /^[0-9]+$/, // int only
		intNull: /^[0-9]*$/, // int & null
		rtrim: /^[\s\uFEFF\xA0]+|[\s\uFEFF\xA0]+$/g, // clean space of string
		longitude: /^(-?((180)|(((1[0-7]\d)|(\d{1,2}))(\.\d+)?)))$/, // 经度
		latitude: /^(-?((90)|((([0-8]\d)|(\d))(\.\d+)?)))$/ // 纬度
	};
	exports.tips = {
		email: '邮箱格式不正确',
		phoneNumber: '手机格式不正确',
		userName: '用户名必须为手机号！',
		password: '密码长度必须为6-23位',
		repassword: '两次密码输入不一致',
		authCode: '验证码格式为6位数字',
		loginLoading: '抢滩登录中...',
		signuping: '玩命注册中...',
		xiaoxiaoSupport: '—校校技术赞助',
		praise: '同学，需要授权才能点赞哦～<br>现在去授权？',
		register: '同学，需要授权才能报名哦～<br>现在去授权？',
		robTicket: '同学，需要授权才能抢票哦～<br>现在去授权？',
		vote: '同学，需要授权才能投票哦～<br>现在去授权？',
		comment: '同学，需要授权才能评论哦～<br>现在去授权？',
		report: '同学，需要授权才能举报哦～<br>现在去授权？',
		action: '同学，需要授权才能操作哦～<br>现在去授权？'
	};
	exports.pages = {
		root: 'http://www.xiaoxiao.la',
		home: '',
		login: '',
		notFound: 'http://xiaoxiao.la/404.html',
		download: '/download.html',
		sJobs: 'http://xiaoxiao.la/discovery/jobs.html', //分享用
		sJob: 'http://xiaoxiao.la/discovery/job.html', //分享用,
		setting: '',
		userZone: '',
		checkTicket: '',
		origin: window.location.origin ? window.location.origin : (window.location.protocol + "//" + window.location.hostname)
	};

	exports.provinces = ["上海", "北京", "天津", "重庆", "广西", "澳门", "香港", "河北", "山东", "辽宁", "黑龙江", "吉林", "甘肃", "青海", "河南", "福建", "台湾", "海南", "山西", "陕西", "四川", "贵州", "安徽", "江苏", "湖北", "湖南", "江西", "浙江", "广东", "云南", "内蒙古", "西藏", "新疆", "宁夏"];
	exports.cities = function(province) {
		var cities = {
			"上海": ["上海"],
			"北京": ["北京"],
			"天津": ["天津"],
			"重庆": ["重庆"],
			"广西": ["南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"],
			"澳门": ["澳门"],
			"香港": ["香港"],
			"河北": ["石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"],
			"山东": ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "威海", "济宁", "泰安", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽"],
			"辽宁": ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"],
			"黑龙江": ["哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化", "大兴安岭"],
			"吉林": ["长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边"],
			"甘肃": ["兰州", "嘉峪关", "金昌", "白银", "天水", "酒泉", "张掖", "武威", "定西", "陇南", "平凉", "庆阳", "临夏", "甘南"],
			"青海": ["西宁", "海东地区", "海北", "黄南", "海南", "果洛", "玉树", "海西"],
			"河南": ["郑州", "开封", "洛阳", "平顶山", "焦作", "鹤壁", "新乡", "安阳", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店"],
			"福建": ["福州", "厦门莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"],
			"台湾": ["台湾"],
			"海南": ["海口", "三亚", "文昌", "琼海", "万宁", "五指山", "东方", "儋州", "临高", "澄迈", "定安", "屯昌", "昌江", "白沙", "琼中", "陵水", "保亭", "乐东"],
			"山西": ["太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁"],
			"陕西": ["西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"],
			"四川": ["成都", "绵阳", "自贡", "攀枝花", "泸州", "德阳", "广元", "遂宁", "内江", "乐山", "南充", "宜宾", "广安", "达州", "眉山", "雅安", "巴中", "资阳", "阿坝", "甘孜", "凉山"],
			"贵州": ["贵阳", "六盘水", "遵义", "安顺", "铜仁", "毕节地区", "黔西南", "黔东南", "黔南"],
			"安徽": ["合肥", "蚌埠", "芜湖", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "阜阳", "宿州", "滁州", "六安", "宣城", "巢湖", "池州", "亳州"],
			"江苏": ["南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"],
			"湖北": ["武汉", "黄石", "襄樊", "十堰", "荆州", "宜昌", "荆门", "鄂州", "孝感", "黄冈", "咸宁", "随州", "恩施", "仙桃", "潜江", "天门", "神农架"],
			"湖南": ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西"],
			"江西": ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"],
			"浙江": ["杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"],
			"广东": ["广州", "深圳", "珠海", "汕头", "韶关", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮"],
			"云南": ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "文山壮族", "红河", "西双版纳", "楚雄", "大理", "德宏", "怒江", "迪庆藏族"],
			"内蒙古": ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安盟", "锡林", "阿拉善"],
			"西藏": ["拉萨", "山南", "日喀则", "那曲", "阿里", "林芝"],
			"新疆": ["乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "昌吉", "和田", "阿克苏", "喀什", "克孜勒苏柯尔克孜", "巴音郭楞", "博尔塔拉", "伊犁", "塔城", "阿勒泰", "石河子", "阿拉尔", "图木舒克", "五家渠"],
			"宁夏": ["银川", "石嘴山", "吴忠", "固原", "中卫"]
		};
		return cities[province];
	};

	/**
	 * 授权微信号配置信息
	 */
	exports.wechat = {
		appId: 'wx489d054714746ca7' //,
			//secret: '837a3e7eab2c800fd0ce09b955a56c03'
	};

	exports.orgs = {
		my: 1, // 校校官方组织
		fudan: 1001 // 复旦大学学生会
	};
	exports.delays = {
		authCode: 90
	};
	exports.rootApi = "/api-front/";
});